openfoam/test_cases/weirOverflow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         80;

deltaT          1e-3;

writeControl    adjustable;

writeInterval   2;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           0.4;

maxAlphaCo      0.4;

maxDeltaT       1;


// ************************************************************************* //

functions{

    // function object for computing the states and actions in order to predict the solver settings for GAMG
    residuals
        {
            type            agentSolverSettings;
            libs            ("${DRL_LIBBIN}/libAgentSolverSettings.so");
            timeStart       1337;
            fields          (p_rgh);
            policy          "policy.pt";
            train           true;
            seed            0;
    }

    // log the execution time per time step for reward function
    time
    {
        type            timeInfo;
        libs            (utilityFunctionObjects);
        timeStart       0;
        perTimeStep     yes;
    }

    probes
        {
            type            probes;
            libs            (sampling);
            name            probes;
            writeControl    timeStep;
            writeInterval   1;
            startTime       0.0;
            fields          (U p p_rgh);
            fixedLocations  true;
            interpolationScheme cell;

            probeLocations
            (
                (18 28 0.5)
                (8 31 0.5)
                (25 15 0.5)
                (30 24 0.5)
                (31 1 0.5)
                (35 12 0.5)
                (40 1 0.5)
                (51 1 0.5)
                (65 1 0.5)
                (80 1 0.5)

            );
            includeOutOfBounds  false;
        }
}
