openfoam/test_cases/weirOverflow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-18  0 -0.5)       // 0
    (  0  0 -0.5)       // 1
    ( 30  0 -0.5)       // 2
    ( 90  0 -0.5)       // 3
    (-18 30 -0.5)       // 4
    (  0 30 -0.5)       // 5
    ( 15 30 -0.5)       // 6
    ( 90 30 -0.5)       // 7
    (-18 54 -0.5)       // 8
    (  0 54 -0.5)       // 9
    ( 15 54 -0.5)       // 10
    ( 90 54 -0.5)       // 11

    (-18  0 0.5)        // 12
    (  0  0 0.5)        // 13
    ( 30  0 0.5)        // 14
    ( 90  0 0.5)        // 15
    (-18 30 0.5)        // 16
    (  0 30 0.5)        // 17
    ( 15 30 0.5)        // 18
    ( 90 30 0.5)        // 19
    (-18 54 0.5)        // 20
    (  0 54 0.5)        // 21
    ( 15 54 0.5)        // 22
    ( 90 54 0.5)        // 23

    // new vertices for new blocks
    (50  0 -0.5)        // 24
    (50 30 -0.5)        // 25
    (50 54 -0.5)        // 26

    (50  0 0.5)        // 27
    (50 30 0.5)        // 28
    (50 54 0.5)        // 29
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (71 57 1) simpleGrading (1 0.25 1)
    hex (2 24 25 6 14 27 28 18) (107 107 1) simpleGrading (2 2.5 1)

    hex (24 3 7 25 27 15 19 28) (107 107 1) simpleGrading (1 2.5 1)

    hex (4 5 9 8 16 17 21 20) (71 57 1) simpleGrading (1 2.5 1)
    hex (5 6 10 9 17 18 22 21) (57 57 1) simpleGrading (1 2.5 1)

    hex (6 25 26 10 18 28 29 22) (107 57 1) simpleGrading (2 2.5 1)
    hex (25 7 11 26 28 19 23 29) (107 57 1) simpleGrading (1 2.5 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 12 16 4)
        (4 16 20 8)
    )
    patch outlet
    (
        (7 19 15 3)
        (11 23 19 7)
    )
    wall lowerWall
    (
        (0 1 13 12)
        (1 5 17 13)
        (5 6 18 17)
        (2 14 18 6)
        (2 24 27 14)
        (24 3 15 27)
    )
    patch atmosphere
    (
        (8 20 21 9)
        (9 21 22 10)
        (10 22 29 26)
        (26 29 23 11)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
