openfoam/test_cases/weirOverflow/Allrun
#!/bin/bash
cd "${0%/*}" || exit
. ${DRL_BASE:?}/openfoam/RunFunctions
#------------------------------------------------------------------------------

# run case
runParallel interFoam
